{"id":"core-001","path":"crates/gently-core","purpose":"Cryptographic primitives, XOR splits, vault management, Berlin Clock key rotation","story":"The Core is the heartstone buried deep beneath the castle. All towers rise from it, all walls anchor to it. Without the heartstone, the castle crumbles. It holds secrets in split pieces -- no single thief can steal what requires two keys to unlock. Time itself turns its locks, as the Berlin Clock taught the ancients.","codie":"pug CORE\nfence\n  bone NOT: expose raw keys\n  bone NOT: skip entropy\nbark crypto <- @rust/gently-core\nbiz -> crypto.ready","depends":[],"readme":"docs/core.md"}
{"id":"codie-001","path":"crates/gently-codie","purpose":"12-keyword instruction language with compression and glyph system","story":"The Prophets needed a tongue that both humans and machines could speak. Twelve sacred words were chosen -- pug for beginnings, biz for endings, bark for fetching, fence for boundaries. With these twelve, any command could be spoken. The words compress into glyphs for the machines, expand into stories for the people.","codie":"pug CODIE\nbark lang <- @rust/gently-codie\nbiz -> lang.parse","depends":[],"readme":"docs/codie.md"}
{"id":"artisan-001","path":"crates/gently-artisan","purpose":"BS-ARTISAN toroidal knowledge storage with Foam and BARF retrieval","story":"The Artisan builds libraries in the shape of donuts -- tori, the mathematicians call them. Walk far enough in any direction and you return to where you started. Knowledge wraps around itself. The BARF retrieval finds what you seek by measuring how far you must walk, boosted by the topology of the donut itself.","codie":"pug ARTISAN\nbark torus <- @rust/gently-artisan\nbiz -> torus.store","depends":[],"readme":"docs/artisan.md"}
{"id":"agents-001","path":"crates/gently-agents","purpose":"Agentic scaffold for tool-using AI agents with 5-element pipeline","story":"The Agents are servants with specific talents. One reads files, another executes commands, a third speaks to the network. They await orders, never acting unbidden. The five elements guide their work: Spirit validates, Air fetches, Water transforms, Earth executes, Fire completes. Through this discipline, chaos becomes order.","codie":"pug AGENTS\nfence\n  bone NOT: act without permission\n  bone NOT: skip validation\nbark agent <- @rust/gently-agents\nbiz -> agent.ready","depends":["core-001","codie-001"],"readme":"docs/agents.md"}
{"id":"brain-001","path":"crates/gently-brain","purpose":"LLM orchestration with Llama support and embeddings","story":"The Brain remembers what you teach it. Feed it documents, and it grows knowledgeable. Ask it questions, and it recalls. But the Brain is not the mind -- it is the library, the index, the servant of thought. It connects to distant oracles (Claude, the cloud minds) and to local sages (Llama, the humble model).","codie":"pug BRAIN\nbark mind <- @rust/gently-brain\nbiz -> mind.think","depends":["core-001","agents-001"],"readme":"docs/brain.md"}
{"id":"alexandria-001","path":"crates/gently-alexandria","purpose":"Distributed knowledge graph with tesseract projection","story":"Alexandria was the greatest library, and so this crate carries its name. Knowledge forms a graph -- ideas connected to ideas, each node a concept, each edge a relationship. The Tesseract projects this graph into eight dimensions, for some truths can only be seen from higher ground.","codie":"pug ALEXANDRIA\nbark graph <- @rust/gently-alexandria\nbiz -> graph.query","depends":["core-001"],"readme":"docs/alexandria.md"}
{"id":"security-001","path":"crates/gently-security","purpose":"FAFO defense system with 16 daemons across 5 layers","story":"Behind the castle walls stand sixteen guardians, each with a different weapon. Some watch the gates (Traffic Sentinels), others patrol the halls (Behavior Profilers). When attackers come, the guardians respond in kind -- first delays, then confusion, then overwhelming force. The FAFO doctrine: around and find out.","codie":"pug SECURITY\nfence\n  bone NOT: trust strangers\n  bone NOT: reveal defenses\nbark guard <- @rust/gently-security\nbiz -> guard.active","depends":["core-001"],"readme":"docs/security.md"}
{"id":"search-001","path":"crates/gently-search","purpose":"Thought index with BBBCP constraint system","story":"To find a needle in a haystack, first remove what is not needle. The BBBCP system (Bone, Blob, Biz, Circle, Pin) eliminates possibilities until only truth remains. Each search pass removes seventy percent of the false. Five passes leave less than one percent. From chaos, clarity emerges.","codie":"pug SEARCH\nbark index <- @rust/gently-search\nbiz -> index.find","depends":["core-001","alexandria-001"],"readme":"docs/search.md"}
{"id":"feed-001","path":"crates/gently-feed","purpose":"Living feed with charge and decay mechanics","story":"Ideas have life force. Fresh thoughts burn bright; old ones fade. The Feed tracks this energy -- charging items when you engage with them, letting them decay when ignored. What matters rises to the top. What you forget sinks to the bottom. The Feed is not a list; it is a garden.","codie":"pug FEED\nbark stream <- @rust/gently-feed\nbiz -> stream.alive","depends":["core-001"],"readme":"docs/feed.md"}
{"id":"gateway-001","path":"crates/gently-gateway","purpose":"API bottleneck where all AI traffic passes","story":"Every road leads through the Gateway. No thought enters or leaves without passing its inspection. This is not tyranny but protection -- the Gateway counts tokens, limits costs, blocks poison, routes traffic to the right destination. It is the checkpoint that keeps the kingdom safe.","codie":"pug GATEWAY\nfence\n  bone NOT: bypass checks\nbark gate <- @rust/gently-gateway\nbiz -> gate.open","depends":["core-001","brain-001","security-001"],"readme":"docs/gateway.md"}
{"id":"btc-001","path":"crates/gently-btc","purpose":"Bitcoin block monitor for entropy and time anchoring","story":"Every ten minutes, the Bitcoin network speaks a number. This number cannot be predicted, cannot be faked, cannot be changed. The BTC monitor listens to this heartbeat, using it as a source of true randomness and a timestamp no one can dispute. The blockchain is the clock that never lies.","codie":"pug BTC\nbark block <- @rust/gently-btc\nbiz -> block.latest","depends":["core-001"],"readme":"docs/btc.md"}
{"id":"dance-001","path":"crates/gently-dance","purpose":"Two-device visual-audio handshake protocol","story":"Two strangers meet and must prove they are friends. One shows a pattern, the other responds with sound. Back and forth they dance until both are certain. No words are exchanged that an eavesdropper could steal. The Dance is trust made visible and audible.","codie":"pug DANCE\nbark handshake <- @rust/gently-dance\nbiz -> handshake.complete","depends":["core-001"],"readme":"docs/dance.md"}
{"id":"mcp-001","path":"crates/gently-mcp","purpose":"Model Context Protocol server for Claude integration","story":"Claude lives in the cloud, powerful but distant. The MCP server builds a bridge -- a protocol both sides understand. Through this bridge, Claude can read local files, search local knowledge, act on local commands. The bridge is narrow by design; only approved actions cross.","codie":"pug MCP\nbark bridge <- @rust/gently-mcp\nbiz -> bridge.connected","depends":["core-001","search-001"],"readme":"docs/mcp.md"}
{"id":"inference-001","path":"crates/gently-inference","purpose":"Inference quality mining and optimization","story":"Not all answers are equal. Some shine with insight; others are dull guesses. The Inference miner examines each response, scoring its quality, clustering similar thoughts, refining the best into gold. Over time, the system learns what wisdom looks like.","codie":"pug INFERENCE\nbark quality <- @rust/gently-inference\nbiz -> quality.score","depends":["core-001","alexandria-001"],"readme":"docs/inference.md"}
{"id":"guardian-001","path":"crates/gently-guardian","purpose":"Free tier node with hardware validation and rewards","story":"The Guardian asks nothing but gives much. Run a Guardian node, and you contribute to the network. The Guardian validates your hardware honestly -- no pretending a laptop is a supercomputer. In return, you earn rewards. The Guardian is the honest worker in the vineyard.","codie":"pug GUARDIAN\nbark node <- @rust/gently-guardian\nbiz -> node.contribute","depends":["btc-001"],"readme":"docs/guardian.md"}
{"id":"web-001","path":"crates/gently-web","purpose":"HTMX adaptive web GUI with ONE SCENE architecture","story":"The Web is a window into the system. Through it, you see the Feed, the Graph, the Security status. But unlike other windows that show many rooms, this one shows ONE SCENE -- a single adaptive view that reshapes itself to show what you need. No navigation, only transformation.","codie":"pug WEB\nbark ui <- @rust/gently-web\nbiz -> ui.render","depends":["core-001","brain-001"],"readme":"docs/web.md"}
{"id":"cli-001","path":"gently-cli","purpose":"Main command-line interface with 28 commands","story":"The CLI is the voice of the operator. Twenty-eight commands speak to every part of the system. Type and the system responds. No clicking, no windows -- just words and answers. For those who know the commands, nothing is faster.","codie":"pug CLI\nbark terminal <- @rust/gently-cli\nbiz -> terminal.exec","depends":["core-001","brain-001","security-001"],"readme":"docs/cli.md"}
{"id":"tui-001","path":"gentlyos-tui","purpose":"FIRE Terminal UI - Fast Intuitive Responsive Elegant","story":"The TUI is the CLI dressed in finery. It draws boxes and colors in the terminal, showing status at a glance. FIRE stands for its virtues: Fast (never lags), Intuitive (needs no manual), Responsive (updates instantly), Elegant (pleasing to the eye).","codie":"pug TUI\nbark interface <- @rust/gentlyos-tui\nbiz -> interface.display","depends":[],"readme":"docs/tui.md"}
{"id":"installer-001","path":"gently-angels-demons-prophets/installer","purpose":"Master installer with environment detection and GPU optimization","story":"The Installer is the Demon who knows all machines. It asks the hardware: What are you? What can you do? Then it configures the system to extract maximum performance. It never guesses, always measures. It never assumes, always validates.","codie":"pug INSTALLER\nfence\n  bone NOT: assume hardware\n  bone NOT: skip validation\nbark env <- @installer/detect\nbark gpu <- @installer/gpu-optimize\nbiz -> installed","depends":[],"readme":"docs/installer.md"}
{"id":"monitor-001","path":"gently-angels-demons-prophets/monitor","purpose":"Git branch monitor and health checker","story":"The Monitor is the Angel who watches the branches. Every commit is counted, every divergence noted. When a branch grows sick (tests fail, builds break), the Monitor sounds the alarm. It keeps the eternal ledger of what was, what is, what changed.","codie":"pug MONITOR\nbark branches <- @git/list\nspin branch IN branches\n  bark health <- @git/check(branch)\n  ? health.failing -> alert(branch)\nbiz -> report","depends":[],"readme":"docs/monitor.md"}
